
## Plan Result




<pre><code>Plan: 22 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * google_cloud_run_service.github_issue_creator
  * google_cloud_run_service.github_issue_finder
  * google_cloud_run_service.slack_message_sender
  * google_cloud_run_service_iam_policy.gcs_bucket_mover
  * google_cloud_run_service_iam_policy.github_issue_creator
  * google_cloud_run_service_iam_policy.github_issue_finder
  * google_cloud_run_service_iam_policy.secrets_leak_log_scanner
  * google_cloud_run_service_iam_policy.slack_message_sender
  * google_eventarc_trigger.secrets_leak_detector_workflow
  * google_monitoring_alert_policy.gcs_bucket_mover
  * google_monitoring_alert_policy.github_issue_creator
  * google_monitoring_alert_policy.github_issue_finder
  * google_monitoring_alert_policy.secrets_leak_log_scanner
  * google_monitoring_alert_policy.slack_message_sender
  * google_project_iam_binding.project_binding_log_writer
  * google_project_iam_binding.workflows_invoker
  * google_secret_manager_secret_iam_member.gh_issue_creator_gh_tools_kyma_bot_token_accessor
  * google_secret_manager_secret_iam_member.gh_issue_finder_gh_tools_kyma_bot_token_accessor
  * google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor
  * google_storage_bucket.kyma_prow_logs_secured
  * google_storage_bucket_iam_member.kyma_prow_logs_secured_object_admin
  * google_workflows_workflow.secrets_leak_detector
* Update
  * google_cloud_run_service.gcs_bucket_mover
  * google_cloud_run_service.secrets_leak_log_scanner


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.template_file.scan_logs_for_secrets_yaml will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "scan_logs_for_secrets_yaml" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            main:
              params: [ event ]
              steps:
                - check:
                    call: json.decode
                    args:
                      data: $${event.data.message.data}
                    result: step_result
                - check_if_prowjob_finished:
                    switch:
                      - condition: $${step_result.status in ["success", "failure", "aborted"]}
                        steps:
                          - search_secrets_leaks_in_logs:
                              call: http.post
                              args:
                                url: ${scan-logs-for-secrets-url}
                                auth:
                                  type: OIDC
                                headers:
                                  Content-Type: "application/cloudevents+json"
                                body: $${event}
                              result: step_result
                          - check_if_leaks_found:
                              switch:
                                - condition: $${step_result.body.type == "prowjob.logs.leaks.found"}
                                  steps:
                                    - move_gcs_bucket:
                                        call: http.post
                                        args:
                                          url: ${move-gcs-bucket-url}
                                          auth:
                                            type: OIDC
                                          headers:
                                            Content-Type: "application/cloudevents+json"
                                            X-Cloud-Trace-Context: $${map.get(step_result.headers, "X-Cloud-Trace-Context")}
                                          body: $${step_result.body}
                                        result: step_result
                                    - search_github_issues:
                                        call: http.post
                                        args:
                                          url: ${search-github-issue-url}
                                          auth:
                                            type: OIDC
                                          headers:
                                            Content-Type: "application/cloudevents+json"
                                            X-Cloud-Trace-Context: $${map.get(step_result.headers, "X-Cloud-Trace-Context")}
                                          body: $${step_result.body}
                                        result: step_result
                                    - check_if_issue_found:
                                        switch:
                                          - condition: $${step_result.body.type == "sap.tools.github.leakissue.notfound"}
                                            steps:
                                              - create_github_issue:
                                                  call: http.post
                                                  args:
                                                    url: ${create-github-issue-url}
                                                    auth:
                                                      type: OIDC
                                                    headers:
                                                      Content-Type: "application/cloudevents+json"
                                                      X-Cloud-Trace-Context: $${map.get(step_result.headers, "X-Cloud-Trace-Context")}
                                                    body: $${step_result.body}
                                                  result: step_result
                                              - send_slack_message:
                                                  call: http.post
                                                  args:
                                                    url: ${send-slack-message-url}/secret-leak-found
                                                    auth:
                                                      type: OIDC
                                                    headers:
                                                      Content-Type: "application/cloudevents+json"
                                                      X-Cloud-Trace-Context: $${map.get(step_result.headers, "X-Cloud-Trace-Context")}
                                                    body: $${step_result.body}
                                                  result: step_result
                                              - return_result:
                                                  return: $${step_result}
                                        return: $${step_result}
                              return: $${step_result}
                    next: end
        EOT
      + vars     = {
          + "create-github-issue-url"   = (known after apply)
          + "move-gcs-bucket-url"       = "https://gcs-bucket-mover-q25ja7ch3q-ey.a.run.app"
          + "scan-logs-for-secrets-url" = "https://secrets-leak-log-scanner-q25ja7ch3q-ey.a.run.app"
          + "search-github-issue-url"   = (known after apply)
          + "send-slack-message-url"    = (known after apply)
        }
    }

  # google_cloud_run_service.gcs_bucket_mover will be updated in-place
  ~ resource "google_cloud_run_service" "gcs_bucket_mover" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/gcs-bucket-mover"
        name                       = "gcs-bucket-mover"
        # (4 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "run.googleapis.com/ingress"        = "all" -> null
              - "run.googleapis.com/operation-id"   = "0649ce4d-5b22-49e0-8cca-025ddff3d67e" -> null
                # (4 unchanged elements hidden)
            }
            # (6 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_service.github_issue_creator will be created
  + resource "google_cloud_run_service" "github_issue_creator" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west3"
      + name                       = "github-issue-creator"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/client-name" = "terraform"
            }
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = "github-issue-creator-cr@sap-kyma-prow.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-docker.pkg.dev/kyma-project/prod/test-infra/creategithubissue:v20230207-d59daeb0"

                  + env {
                      + name  = "APPLICATION_NAME"
                      + value = "github-kyma-bot"
                    }
                  + env {
                      + name  = "COMPONENT_NAME"
                      + value = "github-issue-creator"
                    }
                  + env {
                      + name  = "GITHUB_ORG"
                      + value = "neighbors-team"
                    }
                  + env {
                      + name  = "GITHUB_REPO"
                      + value = "leaks-test"
                    }
                  + env {
                      + name  = "LISTEN_PORT"
                      + value = "8080"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "sap-kyma-prow"
                    }
                  + env {
                      + name  = "TOOLS_GITHUB_TOKEN_PATH"
                      + value = "/etc/gh-token/gh-tools-kyma-bot-token"
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }

                  + volume_mounts {
                      + mount_path = "/etc/gh-token"
                      + name       = "gh-tools-kyma-bot-token"
                    }
                }

              + volumes {
                  + name = "gh-tools-kyma-bot-token"

                  + secret {
                      + secret_name = "gh-tools-kyma-bot-token"
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
          + tag             = (known after apply)
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service.github_issue_finder will be created
  + resource "google_cloud_run_service" "github_issue_finder" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west3"
      + name                       = "github-issue-finder"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/client-name" = "terraform"
            }
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = "github-issue-finder-cr@sap-kyma-prow.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-docker.pkg.dev/kyma-project/prod/test-infra/searchgithubissue:v20230202-40569193"

                  + env {
                      + name  = "APPLICATION_NAME"
                      + value = "secrets-leaks-detector"
                    }
                  + env {
                      + name  = "COMPONENT_NAME"
                      + value = "github-issue-finder"
                    }
                  + env {
                      + name  = "GITHUB_ORG"
                      + value = "neighbors-team"
                    }
                  + env {
                      + name  = "GITHUB_REPO"
                      + value = "leaks-test"
                    }
                  + env {
                      + name  = "LISTEN_PORT"
                      + value = "8080"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "sap-kyma-prow"
                    }
                  + env {
                      + name  = "TOOLS_GITHUB_TOKEN_PATH"
                      + value = "/etc/gh-token/gh-tools-kyma-bot-token"
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }

                  + volume_mounts {
                      + mount_path = "/etc/gh-token"
                      + name       = "gh-tools-kyma-bot-token"
                    }
                }

              + volumes {
                  + name = "gh-tools-kyma-bot-token"

                  + secret {
                      + secret_name = "gh-tools-kyma-bot-token"
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
          + tag             = (known after apply)
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service.secrets_leak_log_scanner will be updated in-place
  ~ resource "google_cloud_run_service" "secrets_leak_log_scanner" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/secrets-leak-log-scanner"
        name                       = "secrets-leak-log-scanner"
        # (4 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "run.googleapis.com/ingress"        = "all" -> null
              - "run.googleapis.com/operation-id"   = "8c6c06d2-6181-4b1c-b961-750ac190d7df" -> null
                # (4 unchanged elements hidden)
            }
            # (6 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_service.slack_message_sender will be created
  + resource "google_cloud_run_service" "slack_message_sender" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west3"
      + name                       = "slack-message-sender"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/client-name" = "terraform"
            }
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-docker.pkg.dev/kyma-project/prod/test-infra/slackmessagesender:v20230207-d59daeb0"

                  + env {
                      + name  = "APPLICATION_NAME"
                      + value = "slack-kyma-bot"
                    }
                  + env {
                      + name  = "COMPONENT_NAME"
                      + value = "slack-message-sender"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "sap-kyma-prow"
                    }
                  + env {
                      + name  = "SLACK_BASE_URL"
                      + value = "https://slack.com/api"
                    }
                  + env {
                      + name  = "SLACK_CHANNEL_ID"
                      + value = "C01KSP10MB5"
                    }
                  + env {
                      + name  = "SLACK_TOKEN_PATH"
                      + value = "/etc/slack-secret"
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }

                  + volume_mounts {
                      + mount_path = "/etc/slack-secret"
                      + name       = "slack-token"
                    }
                }

              + volumes {
                  + name = "slack-token"

                  + secret {
                      + secret_name = "common-slack-bot-token"
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
          + tag             = (known after apply)
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service_iam_policy.gcs_bucket_mover will be created
  + resource "google_cloud_run_service_iam_policy" "gcs_bucket_mover" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west3"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "serviceAccount:secrets-leak-detector-wf@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = "sap-kyma-prow"
      + service     = "gcs-bucket-mover"
    }

  # google_cloud_run_service_iam_policy.github_issue_creator will be created
  + resource "google_cloud_run_service_iam_policy" "github_issue_creator" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west3"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "serviceAccount:secrets-leak-detector-wf@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = (known after apply)
      + service     = "github-issue-creator"
    }

  # google_cloud_run_service_iam_policy.github_issue_finder will be created
  + resource "google_cloud_run_service_iam_policy" "github_issue_finder" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west3"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "serviceAccount:secrets-leak-detector-wf@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = (known after apply)
      + service     = "github-issue-finder"
    }

  # google_cloud_run_service_iam_policy.secrets_leak_log_scanner will be created
  + resource "google_cloud_run_service_iam_policy" "secrets_leak_log_scanner" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west3"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "serviceAccount:secrets-leak-detector-wf@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = "sap-kyma-prow"
      + service     = "secrets-leak-log-scanner"
    }

  # google_cloud_run_service_iam_policy.slack_message_sender will be created
  + resource "google_cloud_run_service_iam_policy" "slack_message_sender" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west3"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "serviceAccount:secrets-leak-detector-wf@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = (known after apply)
      + service     = "slack-message-sender"
    }

  # google_eventarc_trigger.secrets_leak_detector_workflow will be created
  + resource "google_eventarc_trigger" "secrets_leak_detector_workflow" {
      + conditions      = (known after apply)
      + create_time     = (known after apply)
      + etag            = (known after apply)
      + id              = (known after apply)
      + labels          = {
          + "application" = "secrets_leak_detector"
        }
      + location        = "europe-west3"
      + name            = "name"
      + project         = (known after apply)
      + service_account = "projects/sap-kyma-prow/serviceAccounts/secrets-leak-detector-wf@sap-kyma-prow.iam.gserviceaccount.com"
      + uid             = (known after apply)
      + update_time     = (known after apply)

      + destination {
          + workflow = (known after apply)
        }

      + matching_criteria {
          + attribute = "type"
          + value     = "google.cloud.pubsub.topic.v1.messagePublished"
        }

      + transport {
          + pubsub {
              + subscription = (known after apply)
              + topic        = "projects/sap-kyma-prow/topics/prowjobs"
            }
        }
    }

  # google_monitoring_alert_policy.gcs_bucket_mover will be created
  + resource "google_monitoring_alert_policy" "gcs_bucket_mover" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "gcs-bucket-mover-error-logged"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/sap-kyma-prow/notificationChannels/5909844679104799956",
        ]
      + project               = (known after apply)
      + user_labels           = {
          + "app"       = "secrets-leak-detector"
          + "component" = "gcs-bucket-mover"
        }

      + alert_strategy {
          + auto_close = "4 days"

          + notification_rate_limit {
              + period = "6 hr"
            }
        }

      + conditions {
          + display_name = "error-log-message"
          + name         = (known after apply)

          + condition_matched_log {
              + filter = "resource.type=cloud_run_revision AND severity>=ERROR AND jsonPayload.component=gcs-bucket-mover AND labels.io.kyma.app=secrets-leaks-detector"
            }
        }
    }

  # google_monitoring_alert_policy.github_issue_creator will be created
  + resource "google_monitoring_alert_policy" "github_issue_creator" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "github-issue-creator-error-logged"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/sap-kyma-prow/notificationChannels/5909844679104799956",
        ]
      + project               = (known after apply)
      + user_labels           = {
          + "app"       = "secrets-leak-detector"
          + "component" = "github-issue-creator"
        }

      + alert_strategy {
          + auto_close = "4 days"

          + notification_rate_limit {
              + period = "6 hr"
            }
        }

      + conditions {
          + display_name = "error-log-message"
          + name         = (known after apply)

          + condition_matched_log {
              + filter = "resource.type=cloud_run_revision AND severity>=ERROR AND jsonPayload.component=github-issue-creator AND labels.io.kyma.app=secrets-leaks-detector"
            }
        }
    }

  # google_monitoring_alert_policy.github_issue_finder will be created
  + resource "google_monitoring_alert_policy" "github_issue_finder" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "github-issue-finder-error-logged"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/sap-kyma-prow/notificationChannels/5909844679104799956",
        ]
      + project               = (known after apply)
      + user_labels           = {
          + "app"       = "secrets-leak-detector"
          + "component" = "github-issue-finder"
        }

      + alert_strategy {
          + auto_close = "4 days"

          + notification_rate_limit {
              + period = "6 hr"
            }
        }

      + conditions {
          + display_name = "error-log-message"
          + name         = (known after apply)

          + condition_matched_log {
              + filter = "resource.type=cloud_run_revision AND severity>=ERROR AND jsonPayload.component=github-issue-finder AND labels.io.kyma.app=secrets-leaks-detector"
            }
        }
    }

  # google_monitoring_alert_policy.secrets_leak_log_scanner will be created
  + resource "google_monitoring_alert_policy" "secrets_leak_log_scanner" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "secrets-leak-log-scanner-error-logged"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/sap-kyma-prow/notificationChannels/5909844679104799956",
        ]
      + project               = (known after apply)
      + user_labels           = {
          + "app"       = "secrets-leak-detector"
          + "component" = "secrets-leak-log-scanner"
        }

      + alert_strategy {
          + auto_close = "4 days"

          + notification_rate_limit {
              + period = "6 hr"
            }
        }

      + conditions {
          + display_name = "error-log-message"
          + name         = (known after apply)

          + condition_matched_log {
              + filter = "resource.type=cloud_run_revision AND severity>=ERROR AND jsonPayload.component=secrets-leak-log-scanner AND labels.io.kyma.app=secrets-leaks-detector"
            }
        }
    }

  # google_monitoring_alert_policy.slack_message_sender will be created
  + resource "google_monitoring_alert_policy" "slack_message_sender" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "slack-message-sender-error-logged"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/sap-kyma-prow/notificationChannels/5909844679104799956",
        ]
      + project               = (known after apply)
      + user_labels           = {
          + "app"       = "secrets-leak-detector"
          + "component" = "slack-message-sender"
        }

      + alert_strategy {
          + auto_close = "4 days"

          + notification_rate_limit {
              + period = "6 hr"
            }
        }

      + conditions {
          + display_name = "error-log-message"
          + name         = (known after apply)

          + condition_matched_log {
              + filter = "resource.type=cloud_run_revision AND severity>=ERROR AND jsonPayload.component=slack-message-sender AND labels.io.kyma.app=secrets-leaks-detector"
            }
        }
    }

  # google_project_iam_binding.project_binding_log_writer will be created
  + resource "google_project_iam_binding" "project_binding_log_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:secrets-leak-detector-wf@sap-kyma-prow.iam.gserviceaccount.com",
        ]
      + project = "projects/sap-kyma-prow"
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_binding.workflows_invoker will be created
  + resource "google_project_iam_binding" "workflows_invoker" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:secrets-leak-detector-wf@sap-kyma-prow.iam.gserviceaccount.com",
        ]
      + project = "projects/sap-kyma-prow"
      + role    = "roles/workflows.invoker"
    }

  # google_secret_manager_secret_iam_member.gh_issue_creator_gh_tools_kyma_bot_token_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "gh_issue_creator_gh_tools_kyma_bot_token_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:github-issue-creator-cr@sap-kyma-prow.iam.gserviceaccount.com"
      + project   = "sap-kyma-prow"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "trusted_default_kyma-bot-github-sap-token"
    }

  # google_secret_manager_secret_iam_member.gh_issue_finder_gh_tools_kyma_bot_token_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "gh_issue_finder_gh_tools_kyma_bot_token_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:github-issue-finder-cr@sap-kyma-prow.iam.gserviceaccount.com"
      + project   = "sap-kyma-prow"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "trusted_default_kyma-bot-github-sap-token"
    }

  # google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "slack_msg_sender_common_slack_bot_token_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:slack-message-sender-cr@sap-kyma-prow.iam.gserviceaccount.com"
      + project   = "sap-kyma-prow"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "common-slack-bot-token"
    }

  # google_storage_bucket.kyma_prow_logs_secured will be created
  + resource "google_storage_bucket" "kyma_prow_logs_secured" {
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "kyma-prow-logs-secured"
      + project                     = (known after apply)
      + public_access_prevention    = "enforced"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + custom_placement_config {
          + data_locations = [
              + "EUROPE-WEST1",
              + "EUROPE-WEST4",
            ]
        }

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # google_storage_bucket_iam_member.kyma_prow_logs_secured_object_admin will be created
  + resource "google_storage_bucket_iam_member" "kyma_prow_logs_secured_object_admin" {
      + bucket = "kyma-prow-logs-secured"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:gcs-bucket-mover-cr@sap-kyma-prow.iam.gserviceaccount.com"
      + role   = "roles/storage.objectAdmin"
    }

  # google_workflows_workflow.secrets_leak_detector will be created
  + resource "google_workflows_workflow" "secrets_leak_detector" {
      + create_time     = (known after apply)
      + description     = "Workflow is triggered on pubsub ..."
      + id              = (known after apply)
      + name            = "poc-scan-logs-for-secrets"
      + name_prefix     = (known after apply)
      + project         = (known after apply)
      + region          = "europe-west3"
      + revision_id     = (known after apply)
      + service_account = "projects/sap-kyma-prow/serviceAccounts/secrets-leak-detector-wf@sap-kyma-prow.iam.gserviceaccount.com"
      + source_contents = (known after apply)
      + state           = (known after apply)
      + update_time     = (known after apply)
    }

Plan: 22 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":6973,"Program":"tfcmt","SHA1":"1c54cce0b64b12b828d646f4a39d224ce4ec4e1d","Vars":{}} -->